Revit 2024 API
Water.WaterTintEnable Property
 The property labeled "Color" from the "Water" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string WaterTintEnable { get; }
Visual Basic
Public Shared ReadOnly Property WaterTintEnable As String
	Get
Visual C++
public:
static property String^ WaterTintEnable {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WaterTintEnableType".
See Also
Water Class
Autodesk.Revit.DB.Visual Namespace